; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v7 ?v9)
             (pred_7 ?v12 ?v3)
             (pred_9 ?v7 ?v3)
             (pred_10 ?v6 ?v7 )
	     (pred_8 ?v7)
             (pred_5 ?v4)
             (pred_4 ?v12)
             (pred_3 ?v3)
             (pred_1 ?v7)
             (pred_12 ?v12)
             (pred_6 ?v7)
             (pred_11 ))



(:action op_2
:parameters (?v10 ?v2 ?v1 ?v5)
:precondition (and (pred_5 ?v10) (pred_5 ?v2) (pred_4 ?v1) (pred_3 ?v5)
          (pred_2 ?v10 ?v2) (pred_7 ?v1 ?v5)
                   (pred_9 ?v2 ?v5) (pred_8 ?v10) 
                   (pred_1 ?v2) (pred_12 ?v1))
:effect (and  (pred_6 ?v2) (not (pred_1 ?v2))))


(:action op_4
:parameters (?v10 ?v11)
:precondition (and (pred_5 ?v10) (pred_5 ?v11)
               (pred_8 ?v10) (pred_2 ?v10 ?v11) (pred_6 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v10))))

(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_5 ?v10) (pred_4 ?v1) 
                  (pred_8 ?v10) (pred_10 ?v1 ?v10) (pred_11 ))
:effect (and (pred_12 ?v1)
   (not (pred_10 ?v1 ?v10)) (not (pred_11 ))))


(:action op_3
:parameters (?v10 ?v8 ?v13)
:precondition (and (pred_5 ?v10) (pred_4 ?v8) (pred_4 ?v13)
                  (pred_8 ?v10) (pred_12 ?v13) (pred_10 ?v8 ?v10))
:effect (and (pred_12 ?v8) (pred_10 ?v13 ?v10)
        (not (pred_12 ?v13)) (not (pred_10 ?v8 ?v10))))

(:action op_1
:parameters (?v10 ?v1)
:precondition (and (pred_5 ?v10) (pred_4 ?v1) 
                  (pred_8 ?v10) (pred_12 ?v1))
:effect (and (pred_11 ) (pred_10 ?v1 ?v10) (not (pred_12 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_04 obj_13 obj_08 obj_16 obj_11 obj_17 obj_18 obj_02 obj_20 obj_12 obj_09 obj_01 obj_19 obj_15 obj_06
    obj_14 obj_10
    obj_05 obj_03
    )

    (:init
       (pred_11)

       (pred_5 obj_07)
       (pred_5 obj_04)
       (pred_5 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_09)
       (pred_5 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_10)
       (pred_4 obj_05)
       (pred_4 obj_03)

       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_13 obj_17)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_16 obj_02)
       (pred_2 obj_16 obj_11)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_11 obj_17)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_11 obj_16)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_13)
       (pred_2 obj_17 obj_11)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_02 obj_16)
       (pred_2 obj_20 obj_19)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_11)
       (pred_2 obj_20 obj_02)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_09 obj_06)
       (pred_2 obj_09 obj_18)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_01 obj_19)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_19 obj_15)
       (pred_2 obj_19 obj_20)
       (pred_2 obj_19 obj_01)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_19)
       (pred_2 obj_06 obj_09)
       (pred_2 obj_06 obj_15)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_9  obj_09 obj_14)
       (pred_9  obj_20 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_04)
       (pred_6 obj_13)
       (pred_6 obj_08)
       (pred_6 obj_16)
       (pred_6 obj_11)
       (pred_6 obj_17)
       (pred_6 obj_18)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_01)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_06)

       (pred_7  obj_05 obj_14)
       (pred_7  obj_03 obj_10)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_03 obj_04)
       (pred_8 obj_11)
    )

    (:goal (and
       (pred_10 obj_03 obj_12)
    ))
(:constraints
  (always (not (pred_8 obj_17)))
)
)

; plan
1. (op_4 obj_11 obj_04)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_04)
   goals met: 0 of 1
2. (op_5 obj_04 obj_03)
   deleted: (pred_10 obj_03 obj_04) (pred_11)
   added: (pred_12 obj_03)
   goals met: 0 of 1
3. (op_4 obj_04 obj_11)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_11)
   goals met: 0 of 1
4. (op_2 obj_11 obj_20 obj_03 obj_10)
   deleted: (pred_1 obj_20)
   added: (pred_6 obj_20)
   goals met: 0 of 1
5. (op_4 obj_11 obj_20)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_20)
   goals met: 0 of 1
6. (op_4 obj_20 obj_12)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_12)
   goals met: 0 of 1
7. (op_1 obj_12 obj_03)
   deleted: (pred_12 obj_03)
   added: (pred_11) (pred_10 obj_03 obj_12)
   goals met: 1 of 1
